EE990/HW_eeromWriter/EEPROM/library/HT32F520xx_Driver/src/ht32f520xx_tm.c
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_CH_PWMI(CapInit->Channel));
  Assert_Param(IS_TM_CHP(CapInit->Polarity));
  Assert_Param(IS_TM_CHCCS(CapInit->Selection));
  Assert_Param(IS_TM_CHPSC(CapInit->Prescaler));
  Assert_Param(IS_TM_FILTER(CapInit->Filter));

  /* Select the Opposite Input Polarity                                                                     */
  if (CapInit->Polarity == TM_CHP_NONINVERTED)
  {
    OppositePol = TM_CHP_INVERTED;
  }
  else
  {
    OppositePol = TM_CHP_NONINVERTED;
  }

  /* Select the Opposite Input                                                                              */
  if (CapInit->Selection == TM_CHCCS_DIRECT)
  {
    OppositeSel = TM_CHCCS_INDIRECT;
  }
  else
  {
    OppositeSel = TM_CHCCS_DIRECT;
  }

  if (CapInit->Channel == TM_CH_0)
  {
    OppositeChannel = TM_CH_1;
  }
  else
  {
    OppositeChannel = TM_CH_0;
  }

  /* Capture Channel Configuration                                                                          */
  tm_CHx_Config(TMx, CapInit->Channel, CapInit->Polarity, CapInit->Selection, CapInit->Filter);

  /* Set the Input Capture Prescaler value                                                                  */
  TM_CHPSCConfig(TMx, CapInit->Channel, CapInit->Prescaler);

  /* Opposite Channel Configuration                                                                         */
  tm_CHx_Config(TMx, OppositeChannel, OppositePol, OppositeSel, CapInit->Filter);

  /* Set the Input Capture Prescaler value                                                                  */
  TM_CHPSCConfig(TMx, OppositeChannel, CapInit->Prescaler);
}

/*********************************************************************************************************//**
 * @brief Fill each TimeBaseInit member with its default value.
 * @param TimeBaseInit: Point to a \ref TM_TimeBaseInitTypeDef structure.
 * @retval None
 ************************************************************************************************************/
void TM_TimeBaseStructInit(TM_TimeBaseInitTypeDef* TimeBaseInit)
{
  /* Set the default configuration                                                                          */
  TimeBaseInit->CounterMode = TM_CNT_MODE_UP;
  TimeBaseInit->CounterReload = 0xFFFF;
  TimeBaseInit->Prescaler = 0x0000;
  TimeBaseInit->PSCReloadTime = TM_PSC_RLD_IMMEDIATE;
  #if defined(LIBCFG_MCTM0)
  TimeBaseInit->RepetitionCounter = 0;
  #endif
}

/*********************************************************************************************************//**
 * @brief Fill each OutInit member with its default value.
 * @param OutInit: Point to a \ref TM_OutputInitTypeDef structure.
 * @retval None
 ************************************************************************************************************/
void TM_OutputStructInit(TM_OutputInitTypeDef* OutInit)
{
  /* Set the default configuration                                                                          */
  OutInit->Channel = TM_CH_0;
  OutInit->OutputMode = TM_OM_MATCH_NOCHANGE;
  OutInit->Control = TM_CHCTL_DISABLE;
  OutInit->ControlN = TM_CHCTL_DISABLE;
  #if defined(LIBCFG_MCTM0)
  OutInit->Polarity = TM_CHP_NONINVERTED;
  OutInit->PolarityN = TM_CHP_NONINVERTED;
  OutInit->IdleState = MCTM_OIS_LOW;
  OutInit->IdleStateN = MCTM_OIS_LOW;
  #endif
  OutInit->Compare = 0x0000;
  OutInit->AsymmetricCompare = 0x0000;
}

/*********************************************************************************************************//**
 * @brief Fill each CapInit member with its default value.
 * @param CapInit: Point to a \ref TM_CaptureInitTypeDef structure.
 * @retval None
 ************************************************************************************************************/
void TM_CaptureStructInit(TM_CaptureInitTypeDef* CapInit)
{
  /* Set the default configuration                                                                          */
  CapInit->Channel = TM_CH_0;
  CapInit->Polarity = TM_CHP_NONINVERTED;
  CapInit->Selection = TM_CHCCS_DIRECT;
  CapInit->Prescaler = TM_CHPSC_OFF;
  CapInit->Filter = 0x00;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable TMx counter.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void TM_Cmd(HT_TM_TypeDef* TMx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the TM Counter                                                                                */
    TMx->CTR |= CTR_TME;
  }
  else
  {
    /* Disable the TM Counter                                                                               */
    TMx->CTR &= ~CTR_TME;
  }
}

/*********************************************************************************************************//**
 * @brief Configure external clock mode of the TMx. Used ITIx as the clock source.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @param Iti: Trigger source.
 *        This parameter can be one of the following values:
 *        @arg TM_TRSEL_ITI0: Internal trigger 0
 *        @arg TM_TRSEL_ITI1: Internal trigger 1
 *        @arg TM_TRSEL_ITI2: Internal trigger 2
 * @retval None
 ************************************************************************************************************/
void TM_ItiExternalClockConfig(HT_TM_TypeDef* TMx, TM_TRSEL_Enum Iti)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_ITI(Iti));

  /* Select the Internal Trigger. Slave mode will be disable in this function                               */
  TM_StiConfig(TMx, Iti);

  /* Select the STIED as external clock source                                                              */
  TMx->MDCFR |= TM_SMSEL_STIED;
}

