EE990/HW_eeromWriter/EEPROM/library/HT32F520xx_Driver/src/ht32f520xx_tm.c
/*********************************************************************************************************//**
 * @brief Force the TMx CH0OREF waveform to active or inactive level.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @param ForcedAction: Specify the forced action to be set to the output waveform.
 *        This parameter can be one of the following values:
 *        @arg TM_OM_FORCED_ACTIVE   : Forced active level on CH0OREF
 *        @arg TM_OM_FORCED_INACTIVE : Forced inactive level on CH0OREF.
 * @retval None
 ************************************************************************************************************/
void TM_ForcedOREF0(HT_TM_TypeDef* TMx, TM_OM_Enum ForcedAction)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_OM_FORCED(ForcedAction));

  /* Configure The forced output mode                                                                       */
  TMx->CH0OCFR = (TMx->CH0OCFR & CHOCFR_CHOM_MASK) | ForcedAction;
}

/*********************************************************************************************************//**
 * @brief Force the TMx CH1OREF waveform to active or inactive level.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @param ForcedAction: Specify the forced action to be set to the output waveform.
 *        This parameter can be one of the following values:
 *        @arg TM_OM_FORCED_ACTIVE   : Force active level on CH1OREF
 *        @arg TM_OM_FORCED_INACTIVE : Force inactive level on CH1OREF.
 * @retval None
 ************************************************************************************************************/
void TM_ForcedOREF1(HT_TM_TypeDef* TMx, TM_OM_Enum ForcedAction)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_OM_FORCED(ForcedAction));

  /* Configure The forced output mode                                                                       */
  TMx->CH1OCFR = (TMx->CH1OCFR & CHOCFR_CHOM_MASK) | ForcedAction;
}

/*********************************************************************************************************//**
 * @brief Force the TMx CH2OREF waveform to active or inactive level.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @param ForcedAction: Specify the forced action to be set to the output waveform.
 *        This parameter can be one of the following values:
 *        @arg TM_OM_FORCED_ACTIVE   : Force active level on CH2OREF
 *        @arg TM_OM_FORCED_INACTIVE : Force inactive level on CH2OREF.
 * @retval None
 ************************************************************************************************************/
void TM_ForcedOREF2(HT_TM_TypeDef* TMx, TM_OM_Enum ForcedAction)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_OM_FORCED(ForcedAction));

  /* Configure The forced output mode                                                                       */
  TMx->CH2OCFR = (TMx->CH2OCFR & CHOCFR_CHOM_MASK) | ForcedAction;
}

/*********************************************************************************************************//**
 * @brief Force the TMx CH3OREF waveform to active or inactive level.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @param ForcedAction: Specify the forced action to be set to the output waveform.
 *        This parameter can be one of the following values:
 *        @arg TM_OM_FORCED_ACTIVE   : Force active level on CH3OREF
 *        @arg TM_OM_FORCED_INACTIVE : Force inactive level on CH3OREF.
 * @retval None
 ************************************************************************************************************/
void TM_ForcedOREF3(HT_TM_TypeDef* TMx, TM_OM_Enum ForcedAction)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_OM_FORCED(ForcedAction));

  /* Configure The forced output mode                                                                       */
  TMx->CH3OCFR = (TMx->CH3OCFR & CHOCFR_CHOM_MASK) | ForcedAction;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the TMx CRR preload function.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void TM_CRRPreloadCmd(HT_TM_TypeDef* TMx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    /* Set the CRR preload control bit                                                                      */
    TMx->CTR |= CTR_CRBE;
  }
  else
  {
    /* Reset the CRR preload control bit                                                                    */
    TMx->CTR &= ~CTR_CRBE;
  }
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the TMx CHxCCR preload function.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @param Channel: Specify the TM channel.
 *        This parameter can be one of the following values:
 *        @arg TM_CH_0 : TM channel 0
 *        @arg TM_CH_1 : TM channel 1
 *        @arg TM_CH_2 : TM channel 2
 *        @arg TM_CH_3 : TM channel 3
 * @param NewState This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void TM_CHCCRPreloadConfig(HT_TM_TypeDef* TMx, TM_CH_Enum Channel, ControlStatus NewState)
{
  vu32 *pOcfr = (vu32*)&TMx->CH0OCFR + Channel;

