EE990/HW_eeromWriter/EEPROM/library/HT32F520xx_Driver/src/ht32f520xx_tm.c
  /* Select the MTO source                                                                                  */
  TMx->MDCFR = (TMx->MDCFR & MDCFR_MMSEL_MASK) | Sel;
}

/*********************************************************************************************************//**
 * @brief Select slave mode of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @param Sel: Specify the timer slave mode.
 *        This parameter can be one of the following values:
 *        @arg TM_SMSEL_RESTART : Slave restart counter mode.
 *        @arg TM_SMSEL_PAUSE   : Slave pause counter mode.
 *        @arg TM_SMSEL_TRIGGER : Slave trigger counter start mode.
 *        @arg TM_SMSEL_STIED   : Used rising edge of STI as prescaler clock source.
 * @retval None
 ************************************************************************************************************/
void TM_SlaveModeConfig(HT_TM_TypeDef* TMx, TM_SMSEL_Enum Sel)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_SLAVE_MODE(Sel));

  /* Select the slave mode                                                                                  */
  TMx->MDCFR = (TMx->MDCFR & MDCFR_SMSEL_MASK) | Sel;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the master & slave TMx synchronous function.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void TM_TimSyncCmd(HT_TM_TypeDef* TMx, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    /* Set the TSE Bit                                                                                      */
    TMx->MDCFR |= MDCFR_TSE;
  }
  else
  {
    /* Reset the TSE Bit                                                                                    */
    TMx->MDCFR &= ~MDCFR_TSE;
  }
}

/*********************************************************************************************************//**
 * @brief Set counter register value of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @param Counter: Specify the counter register new value.
 * @retval None
 ************************************************************************************************************/
void TM_SetCounter(HT_TM_TypeDef* TMx, u16 Counter)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));

  /* Set the Counter Register value                                                                         */
  TMx->CNTR = Counter;
}

/*********************************************************************************************************//**
 * @brief Set counter reload register value of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @param Reload: Specify the counter reload register new value.
 * @retval None
 ************************************************************************************************************/
void TM_SetCounterReload(HT_TM_TypeDef* TMx, u16 Reload)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));

  /* Set the counter reload register value                                                                  */
  TMx->CRR = Reload;
}

/*********************************************************************************************************//**
 * @brief Set channel 0 capture/compare register value of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @param Cmp: Specify the CH0CCR register new value.
 * @retval None
 ************************************************************************************************************/
void TM_SetCaptureCompare0(HT_TM_TypeDef* TMx, u16 Cmp)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));

  /* Set the CH0CCR register new value                                                                      */
  TMx->CH0CCR = Cmp;
}

/*********************************************************************************************************//**
 * @brief Set channel 1 capture/compare register value of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @param Cmp: Specify the CH1CCR register new value.
 * @retval None
 ************************************************************************************************************/
void TM_SetCaptureCompare1(HT_TM_TypeDef* TMx, u16 Cmp)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));

  /* Set the CH1CCR register new value                                                                      */
  TMx->CH1CCR = Cmp;
}

/*********************************************************************************************************//**
 * @brief Set channel 2 capture/compare register value of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @param Cmp: Specify the CH2CCR register new value.
 * @retval None
 ************************************************************************************************************/
void TM_SetCaptureCompare2(HT_TM_TypeDef* TMx, u16 Cmp)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));

  /* Set the CH2CCR register new value                                                                      */
  TMx->CH2CCR = Cmp;
}

