EE990/HW_eeromWriter/EEPROM/library/HT32F520xx_Driver/src/ht32f520xx_tm.c
/*********************************************************************************************************//**
 * @brief Set channel 3 capture/compare register value of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @param Cmp: Specify the CH3CCR register new value.
 * @retval None
 ************************************************************************************************************/
void TM_SetCaptureCompare3(HT_TM_TypeDef* TMx, u16 Cmp)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));

  /* Set the CH3CCR register new value                                                                      */
  TMx->CH3CCR = Cmp;
}

/*********************************************************************************************************//**
 * @brief Set channel 0 asymmetric compare register value of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @param Cmp: Specify the CH0ACR register new value.
 * @retval None
 ************************************************************************************************************/
void TM_SetAsymmetricCompare0(HT_TM_TypeDef* TMx, u16 Cmp)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));

  /* Set the CH0ACR register new value                                                                      */
  TMx->CH0ACR = Cmp;
}

/*********************************************************************************************************//**
 * @brief Set channel 1 asymmetric compare register value of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @param Cmp: Specify the CH1ACR register new value.
 * @retval None
 ************************************************************************************************************/
void TM_SetAsymmetricCompare1(HT_TM_TypeDef* TMx, u16 Cmp)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));

  /* Set the CH1ACR register new value                                                                      */
  TMx->CH1ACR = Cmp;
}

/*********************************************************************************************************//**
 * @brief Set channel 2 asymmetric compare register value of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @param Cmp: Specify the CH2ACR register new value.
 * @retval None
 ************************************************************************************************************/
void TM_SetAsymmetricCompare2(HT_TM_TypeDef* TMx, u16 Cmp)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));

  /* Set the CH2ACR register new value                                                                      */
  TMx->CH2ACR = Cmp;
}

/*********************************************************************************************************//**
 * @brief Set channel 3 asymmetric compare register value of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @param Cmp: Specify the CH3CCR register new value.
 * @retval None
 ************************************************************************************************************/
void TM_SetAsymmetricCompare3(HT_TM_TypeDef* TMx, u16 Cmp)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));

  /* Set the CH3ACR register new value                                                                      */
  TMx->CH3ACR = Cmp;
}

/*********************************************************************************************************//**
 * @brief Configure input capture prescaler.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @param Channel: Specify the TM channel.
 *        This parameter can be one of the following values:
 *        @arg TM_CH_0 : TM channel 0
 *        @arg TM_CH_1 : TM channel 1
 *        @arg TM_CH_2 : TM channel 2
 *        @arg TM_CH_3 : TM channel 3
 * @param Psc: Specify the input capture prescaler new value.
 *        This parameter can be one of the following values:
 *        @arg TM_CHPSC_OFF : No prescaler
 *        @arg TM_CHPSC_2   : Capture is done once every 2 events
 *        @arg TM_CHPSC_4   : Capture is done once every 4 events
 *        @arg TM_CHPSC_8   : Capture is done once every 8 events
 * @retval None
 ************************************************************************************************************/
void TM_CHPSCConfig(HT_TM_TypeDef* TMx, TM_CH_Enum Channel, TM_CHPSC_Enum Psc)
{
  vu32 *pIcfr = (vu32*)&TMx->CH0ICFR + Channel;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_CH(Channel));
  Assert_Param(IS_TM_CHPSC(Psc));

  /* Reset the CHxPSC bits                                                                                  */
  *pIcfr &= CHICFR_CHPSC_MASK;

  /* Set the capture input prescaler value                                                                  */
  *pIcfr |= Psc;
}

/*********************************************************************************************************//**
 * @brief Set clock division value of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @param Div: Specify the clock division value.
 *        This parameter can be one of the following value:
 *        @arg TM_CKDIV_OFF : fDTS = fCLKIN
 *        @arg TM_CKDIV_2   : fDTS = fCLKIN / 2
 *        @arg TM_CKDIV_4   : fDTS = fCLKIN / 4
 * @retval None
 ************************************************************************************************************/
void TM_CKDIVConfig(HT_TM_TypeDef* TMx, TM_CKDIV_Enum Div)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_CKDIV(Div));

