EE990/HW_eeromWriter/EEPROM/library/HT32F520xx_Driver/src/ht32f520xx_tm.c
  /* Reset the CKDIV Bits                                                                                   */
  TMx->CNTCFR &= CNTCFR_CKDIV_MASK;

  /* Set the CKDIV value                                                                                    */
  TMx->CNTCFR |= Div;
}

/*********************************************************************************************************//**
 * @brief Get channel 0 capture/compare register value of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @return Value of CH0CCR register
 ************************************************************************************************************/
u32 TM_GetCaptureCompare0(HT_TM_TypeDef* TMx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));

  /* Get the CH0CCR register value                                                                          */
  return TMx->CH0CCR;
}

/*********************************************************************************************************//**
 * @brief Get channel 1 capture/compare register value of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @return Value of CH1CCR register
 ************************************************************************************************************/
u32 TM_GetCaptureCompare1(HT_TM_TypeDef* TMx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));

  /* Get the CH1CCR register value                                                                          */
  return TMx->CH1CCR;
}

/*********************************************************************************************************//**
 * @brief Get channel 2 capture/compare register value of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @return Value of CH2CCR register
 ************************************************************************************************************/
u32 TM_GetCaptureCompare2(HT_TM_TypeDef* TMx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));

  /* Get the CH2CCR register value                                                                          */
  return TMx->CH2CCR;
}

/*********************************************************************************************************//**
 * @brief Get channel 3 capture/compare register value of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @return Value of CH3CCR register
 ************************************************************************************************************/
u32 TM_GetCaptureCompare3(HT_TM_TypeDef* TMx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));

  /* Get the CH3CCR register value                                                                          */
  return TMx->CH3CCR;
}

/*********************************************************************************************************//**
 * @brief Get counter value of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @return Value of Counter register
 ************************************************************************************************************/
u32 TM_GetCounter(HT_TM_TypeDef* TMx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));

  /* Get the Counter Register value                                                                         */
  return TMx->CNTR;
}

/*********************************************************************************************************//**
 * @brief Get prescaler value of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @return Value of Prescaler register
 ************************************************************************************************************/
u32 TM_GetPrescaler(HT_TM_TypeDef* TMx)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));

  /* Get the Prescaler Register value                                                                       */
  return TMx->PSCR;
}

/*********************************************************************************************************//**
 * @brief Generate TMx events.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @param TM_EVENT: Stores the event source.
 *        This parameter can be any combination of following:
 *        @arg TM_EVENT_CH0CC     : Timer Capture/compare 0 event
 *        @arg TM_EVENT_CH1CC     : Timer Capture/compare 1 event
 *        @arg TM_EVENT_CH2CC     : Timer Capture/compare 2 event
 *        @arg TM_EVENT_CH3CC     : Timer Capture/compare 3 event
 *        @arg TM_EVENT_UEV       : Timer update event
 *        @arg TM_EVENT_UEV2      : Timer update event 2
 *        @arg TM_EVENT_TEV       : Timer trigger event
 *        @arg TM_EVENT_BRKEV     : Timer break event
 * @retval None
 ************************************************************************************************************/
void TM_GenerateEvent(HT_TM_TypeDef* TMx, u32 TM_EVENT)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_EVENT(TM_EVENT));

  /* Set the event sources                                                                                  */
  TMx->EVGR = TM_EVENT;
}

/*********************************************************************************************************//**
 * @brief Check whether the specified TMx flag has been set.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @param TM_FLAG: Specify the flag to be checked.
 *        This parameter can be one of the following values:
 *        @arg TM_FLAG_CH0CC    : TM Capture/compare 0 flag
 *        @arg TM_FLAG_CH1CC    : TM Capture/compare 1 flag
 *        @arg TM_FLAG_CH2CC    : TM Capture/compare 2 flag
 *        @arg TM_FLAG_CH3CC    : TM Capture/compare 3 flag
 *        @arg TM_FLAG_CH0OC    : TM channel 0 overcapture flag
 *        @arg TM_FLAG_CH1OC    : TM channel 1 overcapture flag
 *        @arg TM_FLAG_CH2OC    : TM channel 2 overcapture flag
 *        @arg TM_FLAG_CH3OC    : TM channel 3 overcapture flag
 *        @arg TM_FLAG_UEV      : TM update flag
 *        @arg TM_FLAG_UEV2     : TM update 2 flag
 *        @arg TM_FLAG_TEV      : TM trigger flag
 *        @arg TM_FLAG_BRK0     : TM break 0 flag
 *        @arg TM_FLAG_BRK1     : TM break 1 flag
 * @return The new state of TM_FLAG (SET or RESET).
 ************************************************************************************************************/
FlagStatus TM_GetFlagStatus(HT_TM_TypeDef* TMx, u32 TM_FLAG)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_FLAG(TM_FLAG));

  if ((TMx->INTSR & TM_FLAG) != 0)
  {
    return SET;
  }
  else
  {
    return RESET;
  }
}

