EE990/HW_eeromWriter/EEPROM/library/HT32F520xx_Driver/src/ht32f520xx_tm.c
/*********************************************************************************************************//**
 * @brief Clear flags of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @param TM_FLAG: Specify the flag to be cleared.
 *        This parameter can be any combination of the following values:
 *        @arg TM_FLAG_CH0CC    : TM Capture/compare 0 flag
 *        @arg TM_FLAG_CH1CC    : TM Capture/compare 1 flag
 *        @arg TM_FLAG_CH2CC    : TM Capture/compare 2 flag
 *        @arg TM_FLAG_CH3CC    : TM Capture/compare 3 flag
 *        @arg TM_FLAG_CH0OC    : TM channel 0 overcapture flag
 *        @arg TM_FLAG_CH1OC    : TM channel 1 overcapture flag
 *        @arg TM_FLAG_CH2OC    : TM channel 2 overcapture flag
 *        @arg TM_FLAG_CH3OC    : TM channel 3 overcapture flag
 *        @arg TM_FLAG_UEV      : TM update flag
 *        @arg TM_FLAG_UEV2     : TM update 2 flag
 *        @arg TM_FLAG_TEV      : TM trigger flag
 *        @arg TM_FLAG_BRK0     : TM break 0 flag
 *        @arg TM_FLAG_BRK1     : TM break 1 flag
 * @retval None
 ************************************************************************************************************/
void TM_ClearFlag(HT_TM_TypeDef* TMx, u32 TM_FLAG)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_FLAG_CLR(TM_FLAG));

  /* Clear the flags                                                                                        */
  TMx->INTSR = ~TM_FLAG;

  /*--------------------------------------------------------------------------------------------------------*/
  /* DSB instruction is added in this function to ensure the write operation which is for clearing interrupt*/
  /* flag is actually completed before exiting ISR. It prevents the NVIC from detecting the interrupt again */
  /* since the write register operation may be pended in the internal write buffer of Cortex-Mx when program*/
  /* has exited interrupt routine. This DSB instruction may be masked if this function is called in the     */
  /* beginning of ISR and there are still some instructions before exiting ISR.                             */
  /*--------------------------------------------------------------------------------------------------------*/
  __DSB();
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the specified interrupts of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @param TM_INT: Specify the TM interrupts sources to be enabled or disabled.
 *        This parameter can be any combination of the following values:
 *        @arg TM_INT_CH0CC     : TM Capture/compare 0 interrupt
 *        @arg TM_INT_CH1CC     : TM Capture/compare 1 interrupt
 *        @arg TM_INT_CH2CC     : TM Capture/compare 2 interrupt
 *        @arg TM_INT_CH3CC     : TM Capture/compare 3 interrupt
 *        @arg TM_INT_UEV       : TM update interrupt
 *        @arg TM_INT_UEV2      : TM update 2 interrupt
 *        @arg TM_INT_TEV       : TM trigger interrupt
 *        @arg TM_INT_BRKEV     : TM break interrupt
 * @param NewState: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void TM_IntConfig(HT_TM_TypeDef* TMx, u32 TM_INT, ControlStatus NewState)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_INT(TM_INT));
  Assert_Param(IS_CONTROL_STATUS(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the interrupt sources                                                                         */
    TMx->DICTR |= TM_INT;
  }
  else
  {
    /* Disable the interrupt sources                                                                        */
    TMx->DICTR &= ~TM_INT;
  }
}

/*********************************************************************************************************//**
 * @brief Check whether the TMx interrupt has occurred.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @param TM_INT: Specify the TM interrupt source to be checked.
 *        This parameter can be one of the following values:
 *        @arg TM_INT_CH0CC     : TM Capture/compare 0 interrupt
 *        @arg TM_INT_CH1CC     : TM Capture/compare 1 interrupt
 *        @arg TM_INT_CH2CC     : TM Capture/compare 2 interrupt
 *        @arg TM_INT_CH3CC     : TM Capture/compare 3 interrupt
 *        @arg TM_INT_UEV       : TM update interrupt
 *        @arg TM_INT_UEV2      : TM update 2 interrupt
 *        @arg TM_INT_TEV       : TM trigger interrupt
 *        @arg TM_INT_BRKEV     : TM break interrupt
 * @return The new state of the TM_INT(SET or RESET)
 ************************************************************************************************************/
FlagStatus TM_GetIntStatus(HT_TM_TypeDef* TMx, u32 TM_INT)
{
  u32 itstatus, itenable;

  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_GET_INT(TM_INT));

  itstatus = TMx->INTSR & TM_INT;
  itenable = TMx->DICTR & TM_INT;

  if ((itstatus != 0) && (itenable != 0))
  {
    return SET;
  }
  else
  {
    return RESET;
  }
}

/*********************************************************************************************************//**
 * @brief Clear interrupt pending bits of the TMx.
 * @param TMx: where TMx is the selected TM from the TM peripheral.
 * @param TM_INT: Specify the TM interrupt to be cleared.
 *        This parameter can be any combination of the following values:
 *        @arg TM_INT_CH0CC     : TM Capture/compare 0 interrupt
 *        @arg TM_INT_CH1CC     : TM Capture/compare 1 interrupt
 *        @arg TM_INT_CH2CC     : TM Capture/compare 2 interrupt
 *        @arg TM_INT_CH3CC     : TM Capture/compare 3 interrupt
 *        @arg TM_INT_UEV       : TM update interrupt
 *        @arg TM_INT_UEV2      : TM update 2 interrupt
 *        @arg TM_INT_TEV       : TM trigger interrupt
 *        @arg TM_INT_BRKEV     : TM break interrupt
 * @retval None
 ************************************************************************************************************/
void TM_ClearIntPendingBit(HT_TM_TypeDef* TMx, u32 TM_INT)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_TM(TMx));
  Assert_Param(IS_TM_INT(TM_INT));

  /* Clear the interrupt pending Bit                                                                        */
  TMx->INTSR = ~TM_INT;

  /*--------------------------------------------------------------------------------------------------------*/
  /* DSB instruction is added in this function to ensure the write operation which is for clearing interrupt*/
  /* flag is actually completed before exiting ISR. It prevents the NVIC from detecting the interrupt again */
  /* since the write register operation may be pended in the internal write buffer of Cortex-Mx when program*/
  /* has exited interrupt routine. This DSB instruction may be masked if this function is called in the     */
  /* beginning of ISR and there are still some instructions before exiting ISR.                             */
  /*--------------------------------------------------------------------------------------------------------*/
  __DSB();
}

